#  "Задание 1.#
# Поработайте с переменными, создайте несколько,
# выведите на экран, запросите у пользователя несколько чисел и
# строк и сохраните в переменные, выведите на экран.#
# Пример:
# Ведите ваше имя: Василий
# Ведите ваш пароль: vas
# Введите ваш возраст: 45
# Ваши данные для входа в аккаунт: имя - Василий, пароль - vas, возраст - 45
name = input('ведите ваше имя :')
password = input('ведите ваш пароль :')
age = int(input('ведите ваш возраст :'))
<<<<<<< HEAD
<<<<<<< HEAD
print(f'имя - {name}, пароль - {password}, возраст - {age}')
n = int(input("введите трехзначное число", ))
sum_value = 0
count_it = 0
while n > 0:
    x = n % 10
    sum_value = sum_value + x
    n = n // 10
    count_it += 1
if count_it != 3:
    print('введено не трхзначное число')
else:
    print(sum_value)
print("ну и еще добавили")
=======
print(f'имя - {name}, пароль - {password}, возраст - {age}')
>>>>>>> parent of c572cd7 (added something)
=======
print(f'имя - {name}, пароль - {password}, возраст - {age}')
>>>>>>> parent of c572cd7 (added something)
